doc/ox-hugo-manual.org
#+TITLE: Ox-Hugo Manual
#+AUTHOR: Kaushal Modi

#+HUGO_BASE_DIR: .
#+HUGO_SECTION: doc

#+OPTIONS: creator:t

#+MACRO: imageclick [[file:./static/images/$1][file:/images/$1]]
#+MACRO: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]
#+MACRO: issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+MACRO: bfissue Blackfriday #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+MACRO: hugoissue Hugo #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+MACRO: ox-hugo-test-file  [[https://raw.githubusercontent.com/kaushalmodi/ox-hugo/master/test/site/content-org/all-posts.org][=all-posts.org=]]
#+MACRO: doc [[/doc/$1][$2]]
#+MACRO: user @[[https://github.com/$1][*$1*]]

*** How do I try =ox-hugo= on my site?
:PROPERTIES:
:EXPORT_FILE_NAME: how-do-I-try-it
:END:
1. =cd= to your Hugo site base directory -- the one that contains the
   =config.toml= (or =config.yaml= or =config.json=).
2. Start the =hugo server= in that directory:
   #+BEGIN_EXAMPLE
   hugo server -D --navigateToChanged
   #+END_EXAMPLE
   - =--navigateToChanged= requires Hugo 0.25+.
3. Above command will mention the localhost where the site is
   served. Open that in your browser.
4. Create a separate directory for Org content in the Hugo site base
   directory. You can name it anything, but I prefer to name it
   =content-org=

   Examples ---
   - [[https://github.com/kaushalmodi/ox-hugo/tree/master/doc][=ox-hugo= documentation site (you're reading it)]]
   - [[https://github.com/kaushalmodi/ox-hugo/tree/master/test/site][=ox-hugo= test site]]
   - [[https://gitlab.com/kaushalmodi/kaushalmodi.gitlab.io][/scripter.co/ -- My blog]]
5. Create an Org file in there and follow the {{{doc(usage,*Usage*)}}}
   section to export it.
